{
  "players": [
    {
      "id": 101,
      "name": "Russell Westbrook",
      "front_image": "https://cdn2.newsok.biz/cache/r960-95ca2252f17cc1ffb795297b664c4936.jpg",
      "back_image": "https://wallpapercave.com/wp/wp1839278.jpg",
      "team": "Los Angeles Lakers",
      "team_image": "https://www.freepnglogos.com/uploads/lakers-logo-png/lakers-free-hd-logo-png-2.png",
      "stat_ppg": 25.4,
      "stat_apg": 10.3,
      "stat_rpg": 10.1,
      "position": "PG",
      "position_name": "Point Guard",
      "bio": "Russell Westbrook III (born November 12, 1988) is an American professional basketball player for the Los Angeles Lakers of the National Basketball Association (NBA). He is a nine-time NBA All-Star and earned the NBA Most Valuable Player Award for the 2016–17 season. He is also a nine-time All-NBA Team member, led the league in scoring in 2014–15 and 2016–17, and won back-to-back NBA All-Star Game Most Valuable Player awards in 2015 and 2016. In 2017, the year he won the league MVP award, Westbrook became one of two players in NBA history to average a triple-double for a season, along with Oscar Robertson in 1962. He also set a record for the most triple-doubles in a season, with 42. He went on to average a triple-double the following two seasons as well as lead the league in assists and become the first player to lead the league in points and assists in multiple seasons. In 2020–21, he averaged a triple-double for the fourth time in five seasons. On May 10, 2021, he passed Robertson for the most career triple-doubles in NBA history. Westbrook has the worst career three point percentage in NBA history of players who have attempted more than 2500+ three point shots."
    },
    {
      "id": 102,
      "name": "Stephen Curry",
      "front_image": "https://upload.wikimedia.org/wikipedia/commons/3/36/Stephen_Curry_dribbling_2016_%28cropped%29.jpg",
      "back_image": "https://cdn.vox-cdn.com/thumbor/2SlKtGt9JgPjIuUTsZdhN5x76v8=/0x0:4211x2803/1200x800/filters:focal(1981x243:2653x915)/cdn.vox-cdn.com/uploads/chorus_image/image/68843614/usa_today_12182424.0.jpg",
      "team": "Golden State Warriors",
      "team_image": "https://www.freepnglogos.com/uploads/warriors-png-logo/golden-state-warriors-png-logo-9.png",
      "stat_ppg": 28.4,
      "stat_apg": 8.3,
      "stat_rpg": 4.1,
      "position": "PG",
      "position_name": "Point Guard",
      "bio": "Wardell Stephen 'Steph' Curry II is an American professional basketball player for the Golden State Warriors of the National Basketball Association (NBA). He plays the point guard position. Many analysts and players have called him the greatest shooter in NBA history. He is credited with revolutionizing the game of basketball by inspiring teams to regularly utilize the three-point shot. A seven-time NBA All-Star, Curry has been named the NBA Most Valuable Player (MVP) twice and has won three NBA championships with the Warriors."
    },
    {
      "id": 103,
      "name": "Lebron James",
      "front_image": "https://upload.wikimedia.org/wikipedia/commons/c/cf/LeBron_James_crop.jpg",
      "back_image": "https://www.nbcsports.com/sites/rsnunited/files/short_form_video/hero/lebron-james-los-angeles-lakers-usatsi_1.jpg",
      "team": "Los Angeles Lakers",
      "team_image": "https://www.freepnglogos.com/uploads/lakers-logo-png/lakers-free-hd-logo-png-2.png",
      "stat_ppg": 32.4,
      "stat_apg": 8.3,
      "stat_rpg": 8.1,
      "position": "SF",
      "position_name": "Small Forward",
      "bio": "LeBron Raymone James Sr. is an American professional basketball player for the Los Angeles Lakers of the National Basketball Association (NBA). Nicknamed 'King James', he is widely considered one of the greatest players in NBA history and is frequently compared to Michael Jordan in debates over the greatest basketball player ever. The only player to have won NBA championships with three franchises (the Cleveland Cavaliers, the Miami Heat, and the Lakers) as NBA Finals MVP, James has competed in ten NBA Finals, eight of them consecutively with the Heat and the Cavaliers from 2011 to 2018. His accomplishments include four NBA championships, four NBA MVP awards, four NBA Finals MVP awards, and two Olympic gold medals. During his 18-year career, James holds the record for all-time playoffs points, is third in all-time points, and eighth in career assists. James has been selected to the All-NBA Team a record 17 times (with a record of 13 First Team selections and 11 consecutive First Team selections, the latter of which is shared with Jordan and Karl Malone), made the NBA All-Defensive First Team five times, and has been named an All-Star 17 times, including three All-Star MVP selections."
    },
    {
      "id": 104,
      "name": "Kevin Durant",
      "front_image": "https://upload.wikimedia.org/wikipedia/commons/3/3a/Kevin_Durant_%28Wizards_v._Warriors%2C_1-24-2019%29_%28cropped%29.jpg",
      "back_image": "https://images.daznservices.com/di/library/sporting_news/f0/4a/kevin-durant-getty-122520-ftrjpg_128pm7lxd9q8m1ri8q2p7p8i6y.jpg?t=-1642609722&quality=100",
      "team": "Brooklyn Nets",
      "team_image": "https://b.fssta.com/uploads/application/nba/team-logos/Nets.png",
      "stat_ppg": 24.4,
      "stat_apg": 7.3,
      "stat_rpg": 6.1,
      "position": "SF",
      "position_name": "Small Forward",
      "bio": "Kevin Wayne Durant, also known simply by his initials KD, is an American professional basketball player for the Brooklyn Nets of the National Basketball Association (NBA). He played one season of college basketball for the Texas Longhorns, and was selected as the second overall pick by the Seattle SuperSonics in the 2007 NBA draft. He played nine seasons with the franchise, which became the Oklahoma City Thunder in 2008, before signing with the Golden State Warriors in 2016, winning back-to-back championships in 2017 and 2018. After sustaining an Achilles injury in the 2019 finals, he joined the Nets as a free agent that summer. He has often been called the best player in the NBA."
    },
    {
      "id": 105,
      "name": "Giannis Antetokounmpo",
      "front_image": "https://upload.wikimedia.org/wikipedia/commons/7/7c/Giannis_Antetokounmpo_%2824845003687%29_%28cropped%29.jpg",
      "back_image": "https://basketballforever.nyc3.cdn.digitaloceanspaces.com/wp-content/uploads/2020/07/23002609/Giannis.jpg",
      "team": "Milwaukee Bucks",
      "team_image": "https://cdn.freebiesupply.com/images/large/2x/milwaukee-bucks-logo-transparent.png",
      "stat_ppg": 32.4,
      "stat_apg": 6.3,
      "stat_rpg": 13.1,
      "position": "SF",
      "position_name": "Small Forward",
      "bio": "Giannis Sina Ugo Antetokounmpo is a Greek professional basketball player for the Milwaukee Bucks of the National Basketball Association (NBA). Antetokounmpo's nationality, in addition to his size, speed and ball-handling skills have earned him the nickname 'Greek Freak'. Antetokounmpo began playing basketball for the youth teams of Filathlitikos in Athens. In 2011, he began playing for the club's senior team before entering the 2013 NBA draft, where he was selected 15th overall by the Bucks. In 2016–17 he led the Bucks in all five major statistical categories and became the first player in NBA history to finish a regular season in the top 20 in all five statistics of total points, rebounds, assists, steals, and blocks. He received the Most Improved Player award in 2017. Antetokounmpo has received five All-Star selections, including being selected as an All-Star captain in 2019 and 2020, as he led the Eastern Conference in voting in these two years."
    },
    {
      "id": 106,
      "name": "James Harden",
      "front_image": "https://upload.wikimedia.org/wikipedia/commons/a/ab/James_Harden_Rockets_cropped.jpg",
      "back_image": "https://e0.365dm.com/21/01/2048x1152/skysports-james-james-harden_5237390.jpg",
      "team": "Brooklyn Nets",
      "team_image": "https://b.fssta.com/uploads/application/nba/team-logos/Nets.png",
      "stat_ppg": 35.7,
      "stat_apg": 13.3,
      "stat_rpg": 5.1,
      "position": "SG",
      "position_name": "Shooting Guard",
      "bio": "James Edward Harden Jr. (born August 26, 1989) is an American professional basketball player for the Brooklyn Nets of the National Basketball Association (NBA). He is one of the NBA's most prolific scorers and has been called the best shooting guard in the NBA, as well as one of the top overall players in the league.He played college basketball for the Arizona State Sun Devils, where he was named a consensus All-American and Pac-10 Player of the Year in 2009. Harden was selected with the third overall pick in the 2009 NBA draft by the Oklahoma City Thunder. In 2012, he was named NBA Sixth Man of the Year with the Thunder and helped the team reach the NBA Finals, where they lost to the Miami Heat in five games."
    },
    {
      "id": 107,
      "name": "Nikola Jokić",
      "front_image": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Nikola_Jokic_free_throw_%28cropped%29.jpg",
      "back_image": "https://www.rts.rs/upload/thumbnail/2019/01/18/5790462_jokic-mjpg",
      "team": "Denver Nuggets",
      "team_image": "https://upload.wikimedia.org/wikipedia/en/thumb/7/76/Denver_Nuggets.svg/1200px-Denver_Nuggets.svg.png",
      "stat_ppg": 35.7,
      "stat_apg": 14.3,
      "stat_rpg": 10.1,
      "position": "C",
      "position_name": "Center",
      "bio": "Nikola Jokić is a Serbian professional basketball player for the Denver Nuggets of the National Basketball Association (NBA) who plays the center position. The three-time NBA All-Star has been named to the All-NBA Team on three occasions (including two first-team selections), and has won the NBA Most Valuable Player Award for the 2020–21 NBA season. He also represents the Serbian national team. Nicknamed 'the Joker', Jokić was selected by the Nuggets in the second round of the 2014 NBA draft. He was voted to the NBA All-Rookie First Team in 2016. In the 2018–19 NBA season, while leading the Nuggets to the Western Conference Semifinals, he received his first All-Star and All-NBA First Team selections. In the following season, he once again received All-Star and All-NBA honors, while leading his team to the Western Conference Finals. Jokić ranks among the top 10 on the all-time list of the NBA players with the most triple-doubles, where he is the leading European player, and he holds the record for fastest triple-double (achieved in 14 minutes and 33 seconds). He also won an Olympic silver medal at the 2016 Rio Games."
    },
    {
      "id": 108,
      "name": "Luka Dončić",
      "front_image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Luka_Don%C4%8Di%C4%87_2021.jpg/1200px-Luka_Don%C4%8Di%C4%87_2021.jpg",
      "back_image": "https://www.bostonglobe.com/resizer/QtBJcHims9VGVRPFU_Wxxbsn9ho=/arc-anglerfish-arc2-prod-bostonglobe/public/JMAZJLHRWUCN3P4TIC6I5V7JGU.jpg",
      "team": "Dallas Mavericks",
      "team_image": "https://www.pngkit.com/png/full/221-2210797_mavs-dallas-mavericks-logo.png",
      "stat_ppg": 25.7,
      "stat_apg": 11.3,
      "stat_rpg": 8.1,
      "position": "SF",
      "position_name": "Small Forward",
      "bio": "Luka Dončić is a Slovenian professional basketball player for the Dallas Mavericks of the National Basketball Association (NBA). He also represents the Slovenian national team. Born in Ljubljana, Dončić shone as a youth player for Union Olimpija before joining the youth academy of Real Madrid. He debuted for their senior team in 2015, at age 16, becoming the youngest in club history. Two years later, he led Madrid to the 2018 EuroLeague title, winning the EuroLeague MVP as well as the Final Four MVP. Dončić was also named the ACB Most Valuable Player and won back-to-back EuroLeague Rising Star and ACB Best Young Player awards. He was selected to the EuroLeague 2010–20 All-Decade Team."
    }
  ]
}
